{"posts":[{"title":"我的2020 - 怀着愿望前行","text":"去年今日本文动笔的时候是在今年的圣诞节 12 月 25 日。去年圣诞节的时候我刚刚向心脏跳动厂提交了离职申请，因为是个实习生，所以非常顺利。上午把自己的工作交接给“新人”以后，就和美国圣诞假回来的同学在五角场吃了顿寿喜烧。他问我之后的去处，我那时信心满满，但是言语中还是给自己留了一些余地，“没什么意外的话，七八月份就能去加州了，我们到时候可以一起吃 in-N-out ”。 当初根本没想到会有什么意外，因为参加了暑期的科研项目，已经留下了一个 5 年有效的 F1。PhD offer 也早就和老板谈妥了，两边都做了背调。未来的一切看起来都那么井井有条，就像是一节一节的台阶，前脚踏上的时候不用思考，后腿就能抬起。 我对于那个阶段自己有着非常清楚的记忆，在跳动厂的实习任务比较轻松，产品线比较佛系，leader 派下来的任务基本都能提前 ddl 一半时间搞定，开会T线转过来的核心大领导刚说完 7 点钟之后公司里没人很心寒，一散会就该溜的全溜了。在这期间我接到的 prof 的考题，是实现 paper 中提到的数据结构，在此之前从来没有认真读过 paper，更不用提什么复现了。但是我还是用我的 4.7 寸小手机读完了 paper。第二天下班后找了间网鱼把 code 全码完了。 绝望的春节春节前后的”意外”也没什么好提的了，我只能玩着RE2重置版过着日子，心里想着我要是哪天被感染了，绝对要变成一个关底BOSS，压根没有把毕设放在心上。万幸的是家里人的收入结构没被新冠影响太多，全都是抱着吃瓜群众的心态看着新闻。在疫情扩散之前，我就闲着无聊读一些已发表的传染病学 paper，这个时候我就知道在疫苗和廉价特效药投产之前，病毒的传染是不会被抑制的。任何形式的隔离都不是关键性转折，而疫苗的大规模投产周期大约在一年半左右。我的出国留学计划必定受到波及。这场”意外“抽醒了我夏天再去吃一顿 in-N-out 的美梦。 愤怒就是对于预期的失望，然而我无气可撒，积攒的负面情绪逐渐变成了绝望。不幸中的万幸，疫情期间，时间都非常充裕，给了我慢慢与自己和解和淡然的机会。面对着重组后充满着不确定性的未来，我再也难以提起干劲。毕设也就渐渐的搁在一边了。想找理由总是有的，你可以找到做毕设的理由，当然也可以找到不做毕设的理由。不仅仅是大学里，所有人都对刚刚加入了新规则的社会焦虑的观望着。 “我要毕业了，谁能借我一只笔”终于，我也轮到了被称为最惨毕业生的一年。我往往都是对最惨毕业生这个称号嗤之以鼻，总是以为这总是由一批运气很差或是觉得自己运气很差的人跳出来自封的。尽管今年似乎没有人再给毕业生戴上这顶荆棘之冠，但 2020 似乎确实是 21 世纪最惨淡的一年了（但愿）。到了四月份左右，学校要求强制返校进行封闭管理，我提出了远程毕设的申请，但还是被拉了回去，最后发现只有我们学院被要求强制返校了。 在这个时候，我开始渐渐理解了国内官僚中最常见的手段：领导给出的任务成文后总是充满了假大空，这并不是因为他们能力的限制，而是他们职务的需求。下级在执行命令时充满了弹性，可以从宽也可以从严。就拿大学生返校而言，学生处可以要求教学尽量恢复正常，有的导员理解为学生尽快返校隔离，有的导员理解为应该推进远程毕设、远程答辩进行。最后哪种做法出了问题，另一种就是正确的”尽量恢复正常“的方法， 如此，责任就完成了向下一级的转嫁，最后评政绩时权力就完成了向上一级的集中。最后，一个看似文明的社会就充斥着时而如同爱抚，时而如同鞭笞的人治。 我想明白这个道理的时候正吃着食堂4块钱一份的青菜，粗略算了算寝室堪比监狱的人均居住面积后，我决定溜回家。虽然大学前三年就是这么一直过来的，但是疫情让我有了更加深刻的认识，同样的条件变得让我更加难以忍受。后来毕设答辩完之后被导员发现了，被禁止返校，事情也就这么过去了。毕业领双证时，我正在和朋友吃着泰式咖喱，我同学打来电话，让我把自己学生证上的每个骑缝写上“已注销”，再拍照上传。“我要毕业了，谁能借我一只笔？”，我在餐桌上如是问道。 手术暑假期间自己竟然病倒了，连续的高烧和反胃，如潮水般的痛苦充斥着我的所有能用来思考的闲暇和梦境。我本来想着打些零工攒攒经历顺带攒些钱，可是又因为身体的原因泡汤了。如果你读到这里觉得很突然，因为事实上是这个病来的就是很突然，我饮食作息都算规律，除了喜欢打音游以外也没什么不良嗜好，经常会锻炼。当然病康复的也很突然，手术时间不到一个小时。因为创口不能缝，我又在家里躺了将近一个月，直到自然愈合。 这个病对我来说莫名其妙，来也匆匆，去也匆匆。住院的那几天我隔壁床转进来一个食道癌晚期的老人。差不多到太阳落山的时候他就会发出痛苦的呻吟，一直到天亮。陪夜的时而是护工，时而是老伴。护工虽然做起来尽心尽责，但是虚弱且撕心裂肺的叫唤声总是会钻入我的耳朵，戳破我的本就没有什么安全感的睡眠。如果是老伴陪夜，那么痛苦的叫唤声很快就会变成有粗浅不一的呼吸声，我就算被吵醒，隔壁床位传来的苍老、干涩而又甜蜜的哄睡声总是能让我幻想到一个不存在任何伤痛与离别的世界，而后再度回归梦乡。 复习和预习我一直觉得我大学的课程总是在预习，因为课上总是昏睡过去，临近期末课本还往往都是新的，只能找人到处要笔记和往年考题。 今年刚上完两门 graduate 的课，让我总是在复习。Algorithm 的课总是让我回忆起高一在noip夏令营时期的讲座和练习题，Architecture 总是让我想起自己自学完的 csapp。除了 final 必须要在美国时区进行以外，总的来说非常愉快。基本只用花其他同学一半的时间就能完成 homework / lab / exam。 我很少能真切的体会到夹在复习和预习间的这个过程，或许这个过程就没有真正的发生过。今年因为看到了tg一组表情包中有好多二次元美少女捧着一本叫sicp的书，我就花了两周把sicp的课上完了。以前一直感到很模糊的几个概念，比如闭包、抽象都变得十分清晰。 2021如果说 2020 是对我 2019 年末美好期望的回应的话，那么我依旧会对 2021 抱有美好的期望。在任何时候，如果有人觉得自己抱有天真而美好的愿望是一个错误的话，我都会说：“不，不是这样的。” 最后感谢 Labelray 对本文的建议，没有她，我或许都没有写完本文的动机。届时，她的博客更新了2020的年终总结，还请诸位移步。","link":"/endtime2020/"},{"title":"新阡去岁留","text":"迳直夫何细！桥危可免扶？远山枫外淡，破屋麦边孤。宿草春风又，新阡去岁无。梨花自寒食，进节只愁余。 ——《寒食上冢》杨万里 节近清明，想记下关于生死之间的想法。 我不相信人死后会留下灵魂，更不相信死后会和生前见过的灵魂相遇。但是，但是若真的能够向已逝之人的灵魂道歉，那么我一定会祈求他的原谅。 第一次见到他是在入学军训的时候，他的脸有些苍白，他的身体就算是以当初A4腰的标准来看也还是瘦得可怜，我找不到任何和他对话的理由。我只是记得他后面几天的军训没有参加，我当初可能觉得他身体不好，毕竟要逃过军训，这或许是最正大光明的理由。我甚至也可能没有去考虑他翘军训的理由，因为酷暑在无时不刻地折磨我用于思考的理智。 我们碰到的教官还不错，这虽然基于我的主观认知，但也绝对不是斯德哥尔摩的产物。教官会带着我们故意正步走到有树荫的地方，然后就地解散，让我们不要跑太远，不要被领导看见。两个班的教官会轮流放风，看到领导来了会紧急整队，让我们随便练点东西，再指点一些“之前”我们动作不得要领的地方。一下午的军训只需要认真20分钟，我们班还因为训练效果最好分到了最轻松的仪仗队扛枪方阵。在巡视的领导眼里下午只训练20分钟的效果显然最好，过量的训练对于掌握基本的动作毫无实质性的帮助，还会让人看起来没精打采。我一直觉得凡事都有窍门，应付军训也不例外。当然，如果能给我一个选择，我肯定会选择抱着新买的游戏本呆在空调间里度过第一个短学期，而不是和教官合作。 之后我在高数课上和他聊过一次天，那时他的脸色依旧苍白，身形看上去更瘦了，能聊起来也只是因为位子比较近。我到教室的时候已经迟到十分钟了，老师似乎还在评讲上次布置的习题，看起来还能跟上。我心里打着算盘：这老师高数讲的很好，听她讲一个小时比我自己琢磨一个小时有用的多，何况手机早上还忘记充电了，算珠拨完于是打算认真听讲。他比我来的还要晚一些，他的脸看起来有些丧气，走路的样子看起来很吃力。他拿出课本后就询问我课堂的进度。突然，他说：“你觉得我们学这个东西真的有用吗？”。“这个问题虽有些唐突，但也挺有意思的“也许吧，我觉得高数我们专业多多少少都会用到点。”“那我想转专业了，想学点能赚钱的，你知道什么专业来钱快吗？”“金融？不过我们学校金融挺弱的，而且还得学高数。”“学这个到底有什么意义啊？”说实话我也不知道，就只能和他简单聊聊行业前景和我们大学毕业的薪资。我觉得总的来说虽不是金银遍地，但至少能有基本的保障和地位。而金融行业比较看经济形势，大环境不好就很容易吃亏。（到这篇文章提笔为止，我在大学期间干过5份不同的工作（实习/兼职），现在回头来看当时的观点只能说还是太年轻了。金融有人做多也有人做空，还有人做对冲。写码的日子不好混可能要去外包赌博网站，或者给P2P打工，运气不好是要吃牢饭的。科研非常依赖拨款和资本对行业前景的预估，青黄不接的时候也不少。）“你说的这些都太远了，有没有什么一两年内来钱快的？”喜欢钱可以理解，但是在一节高数课上对钱这么渴望就很奇怪了，也许是他家里经济压力比较大吧，但是他竟然无视了我的金玉良言。至少我当时是这么想的，因此我说出了大学期间，也是这人生头二十年里最让我后悔的一句话：“你还是再多往前看看吧，未来还是很美好的。”他沉默了。 后来我还记得他在课间摔倒过，但是还没有察觉到有什么不对劲的地方。 他的脸下一次出现在我的脑海中，是因为看到了一则善款筹集的消息。他得了癌症，家中早已无钱治病。他的面容和身形浮现在了眼前，我在脑海里搜刮着和他相关的记忆，接着就是一片头晕目眩。未来并不会对所有人都露出那美好的，充满无限可能性的一面。我很难以同龄人的视角去想象面对行将就木，同时也慢慢拖垮家里人的自己。命运在他眼前展现了最残酷的一面，而我却要他以最美好的一面展望。不久之后，奇迹没有发生。也许无论我当初无论说什么都无法改变他的结局，但是我确实希望我能够收回这一句话。我终究是不相信死后有灵魂，有报应，我所做的一切也都是为了活人。我只是希望这句能成为我这辈子最后悔说出的话而已。 他的面容我隐隐约约有些记得，他的身体轮廓我记得很清楚，我和他之间唯一一次对话大概是忘不了了，我一针一线地寻找了记忆里的所有细节，想起了他的名字。","link":"/respect2dead/"},{"title":"图灵机掷骰子吗？","text":"图灵机掷骰子吗？ 不会，而且也不需要。只要图灵机自己觉得结果像是随机的就行了。 这就是伪随机生成器定理。如果在理念上真的存在无法被鉴别的伪随机生成器，那么一则困扰人类百年的谜语也可以得到解答。 引子 What is the purpose of our defense policy? To defend Britain. No, Bernard. 伪随机性所谓伪随机性，就是某种分布和真随机实在太像了，以至于人们没法在多项式时间内找出该分布的纰漏。 令 UU U 为一个含有若干0和1的真随机的均匀分布， DnD_{n} Dn​ 为我们想要验证的含有分布， CC C 为任意的多项式规模的布尔电路 （可以理解为小于多项式的时间/空间复杂度的输出为0或1的算法）， ε\\varepsilon ε 为与 nn n 相关的任意多项式的倒数，伪随机分布的严谨定义如下： ∣Pr⁡x⊂U[C(X)=1]−Pr⁡x⊂D[C(X)=1]∣≤ε|\\Pr_{x\\subset U}[C(X)=1] - \\Pr_{x\\subset D}[C(X)=1]|\\leq \\varepsilon∣Prx⊂U​[C(X)=1]−Prx⊂D​[C(X)=1]∣≤ε 从反面来说，如果我们能找到一个确定的多项式规模的算法，以足够大的优势鉴别出 xx x 是从 UU U 还是 DnD_{n} Dn​ 中选出来的，那么我们就可以说这个分布也许欺骗不过图灵机。 e.g. 我们构造这样一个C(x)C(x) C(x) ，当 xx x 中的0多余1时输出0，否则输出1。显然， Pr⁡x⊂U[C(X)=1]=0.5\\Pr_{x\\subset U}[C(X)=1] = 0.5 Prx⊂U​[C(X)=1]=0.5 ，因为真正的均匀随机分布0和1的数量应当是相等的。如果一个分布中0总是以 ε\\varepsilon ε 的优势多于或是少于1，那么我们就可以说这个分布被 CC C 所攻破了。 e.g. 我们假设 DnD_{n} Dn​ 是一个由 RC4[1] 算法生成的一个序列，构造 C(x)C(x) C(x) ，如果 xx x 的第二个byte为0则输出0，否则输出1。由于RC4算法存在相当大的偏差，当随机数种子满足一定条件的时候，第二个byte将总是为0。因此，一个非常简单的 CC C 就能够攻破在过去很受欢迎的RC4算法。 读到这里，也许你会觉得我们的要求似乎太高了，任意的 CC C 都无法攻破才能证明一个分布的伪随机性。 伪随机生成器我们常常利用图灵机来帮助生成“伪随机”序列，这样的算法就被成为伪随机生成器。伪随机生成器通常需要一个种子，来帮助生成一定长度的序列。假设种子的长度为 ll l ，那么当我们能够生成 l+1l+1 l+1 位的“伪随机”序列时，我们就能够构造出生成任意多项式 m=poly(l)m = poly(l) m=poly(l) 长度的序列的伪随机生成器。只要第 l+1l + 1 l+1 位足够严谨，那么所有 mm m 位也都会足够严谨。 这点是可以得到严格证明的，详见尾注[2]。 我们有一个真正意义上的伪随机生成器吗？答案既不是有，也不是没有，而是不知道。我们既无法证明某一个完美的伪随机生成器存在，也无法证明它不存在。但是我们知道，如果它真的存在，那么我们不光会多了一个只会说没人能理解的胡话的算法，还能证明一个关于计算复杂性理论的百年之谜。 单向函数与伪随机生成器单向函数 (One-way function)是一种这样的单射函数：对于每一个输入，函数值都（在多项式时间内）容易计算，但是给出一个函数值，算出原始输入却比较困难（无法在多项式时间内使用确定性图灵机计算）。单向函数的存在与否和伪随机生成器有着千丝万缕的联系。 假设某一天，我们得到了一个真正的伪随机生成器 Gl:{0,1}l→{0,1}2lG_{l}:\\{0 ,1\\}^{l} \\rightarrow \\{0 ,1\\}^{2l} Gl​:{0,1}l→{0,1}2l ，我们就可以用它构造这样一个函数 f:{0,1}l→{0,1}lf: \\{0 ,1\\}^{l} \\rightarrow \\{0 ,1\\}^{l} f:{0,1}l→{0,1}l ，其只将 GlG_{l} Gl​ 的前半作为其输出，那么 ff f 就是一个真正的单向函数。我们可以用反证法来进行证明： 我们先可以假设这样一个电路 CC C 可以在多项式时间内找出 ff f 的逆，那么 Pr⁡[f(C(f(x,y)))=f(x,y)]&gt;ε\\Pr[ f(C(f(x,y))) = f(x,y) ] &gt; \\varepsilon Pr[f(C(f(x,y)))=f(x,y)]&gt;ε ，那么C就能够用来鉴别 GlG_{l} Gl​ 和 UU U 的区别。因为 CC C 只能以 12l\\frac{1}{2^{l}} 2l1​ 猜中一个真正的随机分布 UU U ，但是能够以 ε\\varepsilon ε 猜中 xxx 。两者之差无法被忽视。 因此，只要伪随机生成器存在，那么单向函数就存在。同时逆命题也是成立的，只不过证明的过程更加复杂[3]。 等等，P≠NP ？！！是的，只要单向函数存在，那么P就不等于NP了。还是反证法，假设P=NP的话，那么找出一个单向函数的逆就和验证它的逆一样简单。只要代回到原函数就可以验证一个函数的逆，而原函数是可以在多项式时间内完成的计算，那么既然我们能在多项式时间验算它的逆，那么也可以在多项式时间找出所谓单向函数的逆。那么单向函数就不存在了！ 那么 伪随机生成器的存在意味着单向函数的存在，同时也意味着P≠NP。 伪随机这个术语也和计算机科学这一术语一样糟糕，根据定义，真随机均匀分布具有伪随机性，因为我们当然无法分辨它和自己的区别。 直到量子物理，人所能认知到的随机只存在于抽象的概念中 我们大部分认为的随机，其实是非常糟糕的伪随机，是一个系统的复杂程度超出的人脑的认知时举起的白旗。 [1]: Biased outputs of the RC4 [2]: One additional pseudorandom bit implies polynomially more pseudorandom bits [3]: A Pseudorandom Generator from any One-way Function, Johan HÅstad, Russell Impagliazzo, Leonid A. Levin, and Michael Luby SIAM Journal on Computing 1999 28:4, 1364-1396","link":"/prgtheorem/"},{"title":"2020一月新番浅尝","text":"一直想着能不能有一季新番能让我这种懒人写篇这样的博文，等了好久总算等到了。在我以为本人的胃口已经彻底和主流「二次元」脱离之际，这季的新番狠狠地扇了我两个耳光。真香 别对映像研出手！首先没看过原作，但是这前几集的制作质量、信息量都高到爆炸，感觉是汤浅最稳的一辆车，翻给我看？这也是一部让我在追的时候反复N刷的番，看完第一话之后，简单的线稿+flash插补和详尽有趣的设定图开始唤起我现存可怜的想象力了，让我找回了小时候见到什么都会疯狂幻想的感觉。上一次是在玩了塞尔达荒野之息后见到树就想爬，见到果子就想摘下来尝尝，好比自己某部分大脑坐着时光机回到了童年。 另一个直击我的点是producer金森さやか，因为本人最近在字幕组进行着类似的一揽子管理工作，所以和她的几个内心小剧场产生了共鸣。 不，与其说产生共鸣不如说是单方面学习取经，“真的有这种王牌制作人高中生吗”才是我内心的真实想法。 最后讲讲主题。如果说白箱是以动画工业性的一面为主，那么映像研就是动画作者性的一面为主。本番将一个巨大的主创团队简化为了三个JK就是为了凸显这一面。 现代音乐、游戏、建筑、电影、文学这些艺术形式都永远包含这互为表里的两面的冲突，而正确处理两面冲突也是一项重大命题。巧的是个人认为水岛努是商业性拿捏的最好的监督，而汤浅政明是作者性拿捏的最好的监督。 恋爱小行星熟悉的动画工房+芳文社。上一次两家合作是被献祭掉的 Anima Yell，再上一次就是 New game了。 这次的人设沿用了New game系。饱和度较低的发色，精致的眼部刻画。但这作头身比较低，不加说明的话很难让人想到实在高中社团发生的故事。 从OP就可以看出作画动态略显不足，同样是偏沉闷的题材， New game的OP就要有表现力的多。回头看 Anima Yell就算工期预算吃紧，关键的几卡啦啦操还是动态爆表的。但是小行星人物只要没有大幅的动作，画面的精致感还是上线的。 另一个比较影响食用的方面是题材选的硬核，但是讲的肤浅。广度和深度两头都没顾着。不过细节设定方面详尽准确，禁得起推敲，看得出制作投入了许多心血 。随着剧情的深入，对于主题的挖掘还是值得期待的。 魔法纪录站在山顶上往哪走都是下坡路，更何况新房昭之这次连监督的名字都没挂，正大光明的摸起了鱼（bushi，不禁让我担心起三狮的三期。 本篇TV以魔女和魔法少女的冲突切入，魔纪就以都市怪谈入题，巧妙的避免了重复。第一话悬念的设置，对于 《银河铁道之夜》 的致敬还有一股浓浓的 物语 风立刻让我重拾对换新血后SHAFT的信心。 不过最让我开心的是在TV本篇第三话尾黯然离场的巴麻美在魔纪的第三话尾找回了自己的头闪亮登场了kira⭐。本篇TV里为了误导观众，学姐享受了真·主角待遇，前三话的好多卡都是由19年又大火了一把的王牌原画阿部望担当，但是正式出场集数实在是太少了。真希望这次外传能满足一下将近十年来的怨念。 另外听说魔纪可能是24话分割放送。仔细一想还挺有道理的，光前几话信息量就巨大无比。女主的妹妹究竟去了哪？原创角色黑江背后有着什么样的故事？神滨的魔女-魔法少女体系究竟产生了怎样的异变？本篇五色战队会如何登场？小QB又有什么样的目的呢？在表剧情之外我也有许多疑问。主角环的名字象征着什么？本作同 《银河铁道之夜》 有什么样的联系？ED中七海やちよ为什么如此痛苦？本篇中「等价交换」的世界观又将如何被诠释？…… 不过如果真是24话分割放送的话就苦了明年7月的原创动画 Assault Lily Bouquet 了。另外再奶一口魔纪口碑没砸，明年小圆十周年出续集，小圆小焰破镜重圆再续前缘。奶不中就当图一乐，奶中了就神作。 房间露营△当需要内心的宁静时，就能感受到露营的可贵之处了。尽管是在为二期预热，但是小露营一点也不马虎。唯一的缺点就是实在太短了。 某科学的超电磁炮T节操社不愧是节操社。资源分配合理的惊人。炮姐打炮拳皇打拳看的都相当过瘾，OP也是强的不行。日常的部分则是在不违和的情况下能省则省。有可能在为后续工期腾时间，也有可能就快万策尽了。 想着JC最擅长的”合理”资源分配，在回头看看魔禁三期和一方通行外传，唉~。 虚构推理女主人设高光。现在开篇就让人感觉女主不落俗套的番已经不多了。估计是男主体质的主线混着单元剧的形式来讲各种灵异存在。我最担心的还是几个单元剧的剧情同质化，撑不起女主有趣的人设。 ID:INVADED被不同圈子的朋友不约而同地推荐过了。但是看了新奇的设定，超高开的评价，还有番名是两个英文单词组合。我就想起了两部番。ALDNOAH ZERO 和 Re:CREATORS。动漫高手网（wu）上一查，草，这仨同一个监督。于是我当即决定完结观望后再补。如果真的有人在看这段文字的话，请不要曲解我的意思，我永远认为多一部好番比多一部烂番划算，我也对近年来的原创和这个监督没有任何的偏见。正是如此我才打算尽快治好我的PTSD，最后结局如果再是我其实想和你生孩子之流，可能就真好不了了。 异种族风俗娘评鉴指南⚠18X警告里番设定但是三（？）个男的唱op。一边开玩笑，一边物化女性。顺带物化男性。顺带物化性。坦诚地说，尽管看着生理性不适但是难掩将各色⭕幻想解构后再融合这一思路的有趣。 因为太怕痛就全点防御力了有人说是流水账，我说这就是水，连流和帐都没有了。据说这锅大沼心不背。但是水也有水的价值。闭上眼镜想象一下自己沉浸在水中，半浮半沉，感受不到一丝令人疲倦的地心引力-非常非常非常适合入眠 最后，如果真的有人读到了这里，就说明你和我一样闲到了一定境界，而且知道此时（2020.01）中国正在发生着什么。请容我向你推荐美剧 《切尔诺贝利》，小说 《霍乱时期的爱情》 和游戏 《生化危机2：重制版》。她们不仅优秀而且很应景。","link":"/winterbgm2020/"}],"tags":[],"categories":[],"pages":[]}